<a href="https://colab.research.google.com/github/moneshj/Cloud_Computing_Notes/blob/main/SQLite3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Intro

In [ ]:
!pip install db-sqlite3

Collecting db-sqlite3
  Downloading https://files.pythonhosted.org/packages/ff/00/e1f3d7bf1e0bff7c0574c0d5535c041e139d4ce43db196147e4c62f52ed5/db-sqlite3-0.0.1.tar.gz
Collecting db
  Downloading https://files.pythonhosted.org/packages/a9/22/f65d64c83e63790b3273c6adb3bff338ad594f46d84b41bd1f94593b40a6/db-0.1.1.tar.gz
Collecting antiorm
  Downloading https://files.pythonhosted.org/packages/0b/f8/71baa4824d9666c1be51d117119579a97f461ddbded48b2e01a6ad0554b5/antiorm-1.2.1.tar.gz (171kB)
     |████████████████████████████████| 174kB 25.4MB/s
Building wheels for collected packages: db-sqlite3, db, antiorm
  Building wheel for db-sqlite3 (setup.py) ... done
  Created wheel for db-sqlite3: filename=db_sqlite3-0.0.1-cp37-none-any.whl size=1796 sha256=9c72efb4ea115ac9214896ff70b51a9322a9ef5c5267058e81546749b1798fa7
  Stored in directory: /root/.cache/pip/wheels/e0/f8/cb/08e3a3a63bdea9ac3a0cccd140636b6cf94e3fb7df1070b12e
  Building wheel for db (setup.py) ... done
  Created wheel for db: filename=db-0.1.1-cp37-none-any.whl size=3894 sha256=597db1ff5ab0c51588876c0efcfd8e79009b42dafeb53f2dd992f6c13c44e3d7
  Stored in directory: /root/.cache/pip/wheels/30/eb/ba/237fa002d1d1b2e73cedcefd26a9db37c4b72c7e5156ea0501
  Building wheel for antiorm (setup.py) ... done
  Created wheel for antiorm: filename=antiorm-1.2.1-cp37-none-any.whl size=31668 sha256=6e0a7399d15e7193284decd0193e9b903f873ce2697462383d1c691b30ece0f6
  Stored in directory: /root/.cache/pip/wheels/b0/91/4d/f8fe808786ff1cda9e7e99e1b1bbda9196ab26786017965313
Successfully built db-sqlite3 db antiorm
Installing collected packages: antiorm, db, db-sqlite3
Successfully installed antiorm-1.2.1 db-0.1.1 db-sqlite3-0.0.1

In [ ]:
import pandas as pd
import sqlite3
from datetime import date

In [ ]:
#connecting with the database.
db = sqlite3.connect("testing.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results(Name text, Date datetime, Mobile text,Mail text)")
except:
  print("Already table existed !!")

In [ ]:
db = sqlite3.connect("testing.db")

In [ ]:
Date = date.today().strftime("%d-%m-%Y")
Name = "TestDemo"
Mobile = "9000011101"
Mail = "moneshkalavai@gmail.com"

In [ ]:
cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
db.execute(cmd)
db.commit()

# Querying

### Type - 1 Querying

In [ ]:
db = sqlite3.connect("testing.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('TestDemo', '11-05-2021', '9000011101', 'moneshkalavai@gmail.com')

### Type - 2 Querying

In [ ]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                     Mail
0  TestDemo  11-05-2021  9000011101  moneshkalavai@gmail.com

# Batch-wise data storage

In [ ]:

def pushtoDB(Name,Mobile,Mail):
#inserting values inside the created table
    db = sqlite3.connect("testing.db")    
    from datetime import date
    
    Date = date.today().strftime("%t-%d-%m-%Y")
    cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
    db.execute(cmd)
    db.commit()

In [ ]:
data = pd.read_csv("dummy.csv")
data.head()
data.shape

(1128, 3)

In [ ]:
!git clone https://github.com/kiranbeethoju/TeachingMachine.git

Cloning into 'TeachingMachine'...
remote: Enumerating objects: 9, done.
remote: Counting objects: 100% (9/9), done.
remote: Compressing objects: 100% (8/8), done.
remote: Total 9 (delta 2), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (9/9), done.

In [ ]:
pushtoDB("Testttt","121","2112")

In [ ]:
db = sqlite3.connect("testing.db")
qry = "SELECT * FROM results"
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                     Mail
0  TestDemo  11-05-2021  9000011101  moneshkalavai@gmail.com
1   Testttt  11-05-2021         121                     2112
2     Test1  11-05-2021  9000000000    testermail1@gmail.com
3     Test2  11-05-2021  9000000001    testermail2@gmail.com
4     Test3  11-05-2021  9000000002    testermail3@gmail.com

## passing the csv values into database

In [ ]:
for i in range(0,len(data)):
  pushtoDB(data.iloc[i][0],data.iloc[i][1],data.iloc[i][2])

In [ ]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results WHERE Name="TestDemo"

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                     Mail
0  TestDemo  11-05-2021  9000011101  moneshkalavai@gmail.com

In [ ]:
qry = " SELECT * FROM results "
df = pd.read_sql_query(qry,db)
df.head()

       Name        Date      Mobile                     Mail
0  TestDemo  11-05-2021  9000011101  moneshkalavai@gmail.com
1   Testttt  11-05-2021         121                     2112
2     Test1  11-05-2021  9000000000    testermail1@gmail.com
3     Test2  11-05-2021  9000000001    testermail2@gmail.com
4     Test3  11-05-2021  9000000002    testermail3@gmail.com

In [ ]:
df.shape

(1130, 4)